app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies" ORDER BY "companies"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @company = Company.all

SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @company = Company.find(permitted_params[:id])

INSERT INTO "companies" ("name", "details", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "ValDan Autos"], ["details", "Car Sales"], ["created_at", "2020-06-08 15:00:22.101993"], ["updated_at", "2020-06-08 15:00:22.101993"]]
---
  def create
    @company = Company.new(permitted_params[:company])

    if @company.save

SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "companies" WHERE "companies"."id" = ?  [["id", 11]]
---
  def destroy
    @company = Company.find(permitted_params[:id])
    @company.destroy